levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_cmp.c
/**
 *******************************************************************************
 * @file  hc32m423_cmp.c
 * @brief This file provides firmware functions to manage the Comparator(CMP).
 *
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-02-05       Wangmin         First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32m423_cmp.h"
#include "hc32m423_utility.h"

/**
 * @addtogroup HC32M423_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_CMP CMP
 * @brief CMP Driver Library
 * @{
 */

#if (DDL_CMP_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup CMP_Local_Macros CMP Local Macros
 * @{
 */


/**
 * @defgroup CMP_Check_Parameters_Validity CMP Check Parameters Validity
 * @{
 */

#define IS_CMP_INSTANCE(x)                                                     \
(   (M4_CMP1 == (x))                            ||                             \
    (M4_CMP2 == (x))                            ||                             \
    (M4_CMP3 == (x)))

#define IS_CMP_MODE(x)                                                         \
(   (CMP_MODE_NORMAL == (x))                    ||                             \
    (CMP_MODE_WINDOW == (x)))

#define IS_CMP_CVSL(x)                                                         \
(   (CMP_CVSL_NONE == (x))                      ||                             \
    (CMP_CVSL_IVCMPx_0 == (x))                  ||                             \
    (CMP_CVSL_IVCMPx_1 == (x))                  ||                             \
    (CMP_CVSL_IVCMPx_2 == (x))                  ||                             \
    (CMP_CVSL_VREF == (x)))

#define IS_CMP_RVSL(x)                                                         \
(   (CMP_RVSL_NONE == (x))                      ||                             \
    (CMP_RVSL_IVREF1 == (x))                    ||                             \
    (CMP_RVSL_IVREF2 == (x))                    ||                             \
    (CMP_RVSL_DAC == (x)))

#define IS_CMP_OUT_POLARITY(x)                                                 \
(   (CMP_OUT_REVERSE_OFF == (x))                ||                             \
    (CMP_OUT_REVERSE_ON == (x)))

#define IS_CMP_OUT_DETECT_EDGE(x)                                              \
(   (CMP_DETECT_EDGS_NONE == (x))               ||                             \
    (CMP_DETECT_EDGS_RISING == (x))             ||                             \
    (CMP_DETECT_EDGS_FALLING == (x))            ||                             \
    (CMP_DETECT_EDGS_BOTH == (x)))

#define IS_CMP_OUT_FILTER(x)                                                   \
(   (CMP_OUT_FILTER_NONE == (x))                ||                             \
    (CMP_OUT_FILTER_PCLK == (x))                ||                             \
    (CMP_OUT_FILTER_PCLKDIV8 == (x))            ||                             \
    (CMP_OUT_FILTER_PCLKDIV32 == (x)))

#define IS_CMP_TIMWIN_FUNC(x)                                                  \
(   (CMP_TIMERWIN_OFF == (x))                   ||                             \
    (CMP_TIMERWIN_ON == (x)))

#define IS_CMP_TIMWIN_SELECT(x)                                                \
(   (CMP_TIMERWIN_TIMB_1_PWM1_3_5 == (x))       ||                             \
    (CMP_TIMERWIN_TIMB_1_PWM2_4_6 == (x))       ||                             \
    (CMP_TIMERWIN_TIM4_OWL == (x))              ||                             \
    (CMP_TIMERWIN_TIM4_OWH == (x))              ||                             \
    (CMP_TIMERWIN_TIM4_OVL == (x))              ||                             \
    (CMP_TIMERWIN_TIM4_OVH == (x))              ||                             \
    (CMP_TIMERWIN_TIM4_OUL == (x))              ||                             \
    (CMP_TIMERWIN_TIM4_OUH == (x)))

#define IS_CMP_TIMWIN_INVALIDLEVEL(x)                                          \
(   (CMP_TIMERWIN_INVALID_LEVEL_LOW == (x))     ||                             \
    (CMP_TIMERWIN_INVALID_LEVEL_HIGH == (x)))

#define IS_CMP_TIMWIN_OUT_LEVEL(x)                                             \
(   (CMP_TIMERWIN_OUT_LEVEL_LOW == (x))         ||                             \
    (CMP_TIMERWIN_OUT_LEVEL_HIGH == (x)))

#define IS_CMP_DAC_ALIGN_MODE(x)                                               \
(   (CMP_DAC_ALIGN_RIGHT == (x))                ||                             \
    (CMP_DAC_ALIGN_LEFT == (x)))

/**
 * @}
 */

/**
 * @}
 */

