levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_cmp.c
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
static void CMP_Delay300ns(void);

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 * @defgroup CMP_Global_Functions CMP Global Functions
 * @{
 */

/**
 * @brief  Voltage compare function command
 * @param  [in] CMPx              Pointer to CMP instance register base,This
 *                                parameter can be one of the following values:
 *              @arg M4_CMP1:     CMP unit 1 instance register base
 *              @arg M4_CMP2:     CMP unit 2 instance register base
 *              @arg M4_CMP3:     CMP unit 3 instance register base
 * @param  [in] enNewSta          The function new state.
 *              @arg              This parameter can be: Enable or Disable.
 * @retval An en_result_t enumeration value:
 *              - Ok:             Set successfully
 *              - ErrorInvalidParameter: CMPx is invalid instance
 */
en_result_t CMP_FuncCmd(M4_CMP_TypeDef *CMPx, en_functional_state_t enNewSta)
{
    en_result_t enRet = Ok;
    /* Check CMPx instance */
    if (!IS_CMP_INSTANCE(CMPx))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

        if(Enable == enNewSta)
        {
            SET_REG8_BIT(CMPx->MDR, CMP_MDR_CENB);
            /* Delay 300ns*/
            CMP_Delay300ns();
        }
        else
        {
            CLEAR_REG8_BIT(CMPx->MDR, CMP_MDR_CENB);
        }
    }
    return enRet;
}

/**
 * @brief  Voltage compare interrupt function command
 * @param  [in] CMPx              Pointer to CMP instance register base,This
 *                                parameter can be one of the following values:
 *              @arg M4_CMP1:     CMP unit 1 instance register base
 *              @arg M4_CMP2:     CMP unit 2 instance register base
 *              @arg M4_CMP3:     CMP unit 3 instance register base
 * @param  [in] enNewSta          The function new state.
 *              @arg              This parameter can be: Enable or Disable.
 * @retval An en_result_t enumeration value:
 *              - Ok:             Set successfully
 *              - ErrorInvalidParameter: CMPx is invalid instance
 */
en_result_t CMP_IntCmd(M4_CMP_TypeDef *CMPx, en_functional_state_t enNewSta)
{
    en_result_t enRet = Ok;
    /* Check CMPx instance */
    if (!IS_CMP_INSTANCE(CMPx))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

        (Enable == enNewSta) ?
          SET_REG8_BIT(CMPx->FIR, CMP_FIR_CIEN) :
           CLEAR_REG8_BIT(CMPx->FIR, CMP_FIR_CIEN);
    }
    return enRet;
}

/**
 * @brief  Voltage compare output command
 * @param  [in] CMPx              Pointer to CMP instance register base,This
 *                                parameter can be one of the following values:
 *              @arg M4_CMP1:     CMP unit 1 instance register base
 *              @arg M4_CMP2:     CMP unit 2 instance register base
 *              @arg M4_CMP3:     CMP unit 3 instance register base
 * @param  [in] enNewSta          The function new state.
 *              @arg              This parameter can be: Enable or Disable.
 * @retval An en_result_t enumeration value:
 *              - Ok:             Set successfully
 *              - ErrorInvalidParameter: CMPx is invalid instance
 */
en_result_t CMP_OutputCmd(M4_CMP_TypeDef *CMPx, en_functional_state_t enNewSta)
{
    en_result_t enRet = Ok;
    /* Check CMPx instance */
    if (!IS_CMP_INSTANCE(CMPx))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

        (Enable == enNewSta) ?
          SET_REG8_BIT(CMPx->OCR, CMP_OCR_COEN) :
           CLEAR_REG8_BIT(CMPx->OCR, CMP_OCR_COEN);
    }
    return enRet;
}

/**
 * @brief  Voltage compare output port VCOUT function command
 * @param  [in] CMPx              Pointer to CMP instance register base,This
 *                                parameter can be one of the following values:
 *              @arg M4_CMP1:     CMP unit 1 instance register base
 *              @arg M4_CMP2:     CMP unit 2 instance register base
 *              @arg M4_CMP3:     CMP unit 3 instance register base
 * @param  [in] enNewSta          The function new state.
 *              @arg              This parameter can be: Enable or Disable.
 * @retval An en_result_t enumeration value:
 *              - Ok:             Set successfully
 *              - ErrorInvalidParameter: CMPx is invalid instance
 */
en_result_t CMP_VCOUTCmd(M4_CMP_TypeDef *CMPx, en_functional_state_t enNewSta)
{
    en_result_t enRet = Ok;
    /* Check CMPx instance */
    if (!IS_CMP_INSTANCE(CMPx))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

        (Enable == enNewSta) ?
          SET_REG8_BIT(CMPx->OCR, CMP_OCR_CPOE) :
           CLEAR_REG8_BIT(CMPx->OCR, CMP_OCR_CPOE);
    }
    return enRet;
}

/**
 * @brief  Voltage compare result flag read
 * @param  [in] CMPx              Pointer to CMP instance register base,This
 *                                parameter can be one of the following values:
 *              @arg M4_CMP1:     CMP unit 1 instance register base
 *              @arg M4_CMP2:     CMP unit 2 instance register base
 *              @arg M4_CMP3:     CMP unit 3 instance register base
 * @param  [out] penFunSta        Return the CMON flag status.
 *              @arg  This parameter can be: Set or Reset.
 *              In normal mode
 *              - Reset:          compare voltage < reference voltage
 *              - Set:            compare voltage > reference voltage
 *              In Window mode
 *              - Reset:          compare voltage < reference low voltage or
 *                                compare voltage > reference high voltage
 *              - Set:            compare voltage > reference low voltage and
 *                                compare voltage < reference high voltage
 * @retval An en_result_t enumeration value:
 *              - Ok:             Read successfully
 *              - ErrorInvalidParameter: CMPx is invalid instance
 */
en_result_t CMP_ResultGet(M4_CMP_TypeDef *CMPx, en_flag_status_t* penFunSta)
{
    en_result_t enRet = Ok;
    /* Check CMPx instance */
    if ((!IS_CMP_INSTANCE(CMPx)) || (NULL == penFunSta))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        *penFunSta = READ_BIT(CMPx->MDR, CMP_MDR_CMON) ? Reset : Set;
    }

    return enRet;
}

/**
 * @brief  Voltage compare timer windows function configuration
 * @param  [in] CMPx              Pointer to CMP instance register base,This
 *                                parameter can be one of the following values:
 *              @arg M4_CMP1:     CMP unit 1 instance register base
 *              @arg M4_CMP2:     CMP unit 2 instance register base
 *              @arg M4_CMP3:     CMP unit 3 instance register base
 * @param  [in] pstcCMP_TimerWinStruct Configuration structure for timer windows function
 *              pstcCMP_TimerWinStruct->u8TWMode
 *                                Timer windows mode on or off @ref CMP_TimerWin_func
 *              @arg              This parameter can be: CMP_TIMERWIN_OFF or CMP_TIMERWIN_ON.
 *              pstcCMP_TimerWinStruct->u8TWInvalidLevel
 *                                The output level when timer windows valid.@ref CMP_TimerWin_Invalid_Level
 *              @arg              This parameter can be: CMP_TIMERWIN_INVALID_LEVEL_LOW or CMP_TIMERWIN_INVALID_LEVEL_HIGH.
 *              pstcCMP_TimerWinStruct->u8TWSelect
 *                                The timer event for timer windows function.
 *              @arg              This parameter can be one of the values @ref CMP_TimerWin_Select
 *              pstcCMP_TimerWinStruct->u8TWOutLevel
 *                                Timer windows mode output level.@ref CMP_TimerWin_output_Level
 *              @arg              This parameter can be: CMP_TIMERWIN_OUT_LEVEL_LOW or CMP_TIMERWIN_OUT_LEVEL_HIGH.
 * @retval An en_result_t enumeration value:
 *              - Ok:             Successfully
 *              - ErrorInvalidParameter: CMPx or pointer of structure is invalid
 */
en_result_t CMP_TimerWindowsCfg(M4_CMP_TypeDef *CMPx,
                                 const stc_cmp_timerwindows_t* pstcCMP_TimerWinStruct)
{
    en_result_t enRet = Ok;
    /* Check CMPx instance and configuration structure*/
    if ((!IS_CMP_INSTANCE(CMPx)) || (NULL == pstcCMP_TimerWinStruct))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_CMP_TIMWIN_INVALIDLEVEL(pstcCMP_TimerWinStruct->u8TWInvalidLevel));
        DDL_ASSERT(IS_CMP_TIMWIN_FUNC(pstcCMP_TimerWinStruct->u8TWMode));
        DDL_ASSERT(IS_CMP_TIMWIN_OUT_LEVEL(pstcCMP_TimerWinStruct->u8TWOutLevel));
        DDL_ASSERT(IS_CMP_TIMWIN_SELECT(pstcCMP_TimerWinStruct->u8TWSelect));

        /* Write TWR2 register and TWR1 register */
        pstcCMP_TimerWinStruct->u8TWOutLevel ?
          SET_REG8_BIT(CMPx->TWR2, pstcCMP_TimerWinStruct->u8TWSelect):
            CLEAR_REG8_BIT(CMPx->TWR2, pstcCMP_TimerWinStruct->u8TWSelect);

        WRITE_REG(CMPx->TWR1, pstcCMP_TimerWinStruct->u8TWSelect);

        /* Enable timer windows mode and configuration output level in windows invalid */
        MODIFY_REG8(CMPx->OCR,
                   CMP_OCR_TWOL | CMP_OCR_TWOE,
                   pstcCMP_TimerWinStruct->u8TWMode | pstcCMP_TimerWinStruct->u8TWInvalidLevel);
    }
    return enRet;
}


/**
 * @brief  CMP normal mode initialize
 * @param  [in] CMPx              Pointer to CMP instance register base,This
 *                                parameter can be one of the following values:
 *              @arg M4_CMP1:     CMP unit 1 instance register base
 *              @arg M4_CMP2:     CMP unit 2 instance register base
 *              @arg M4_CMP3:     CMP unit 3 instance register base
 * @param  [in] pstcCMP_InitStruct Configuration structure for normal mode initialize
 *              pstcCMP_InitStruct->u8CmpVol
 *                                Compare voltage, @ref CMP_CVSL_Source
 *              pstcCMP_InitStruct->u8RefVol
 *                                Reference voltage, @ref CMP_RVSL_Source
 *              pstcCMP_InitStruct->u8OutPolarity
 *                                Output polarity select, @ref CMP_Out_Polarity_Select
 *              pstcCMP_InitStruct->u8OutDetectEdges
 *                                Output detect edge, @ref CMP_Out_Detect_Edge
 *              pstcCMP_InitStruct->u8OutFilter
 *                                Output Filter, @ref CMP_Out_Filter
 *
 * @retval An en_result_t enumeration value:
 *              - Ok:             Successfully
 *              - ErrorInvalidParameter: CMPx or pointer of structure is invalid
 */
en_result_t CMP_NormalModeInit(M4_CMP_TypeDef *CMPx,
                     const stc_cmp_init_t* pstcCMP_InitStruct)
{
    en_result_t enRet = Ok;
    /* Check CMPx instance and configuration structure*/
    if ((!IS_CMP_INSTANCE(CMPx)) || (NULL == pstcCMP_InitStruct))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_CMP_OUT_DETECT_EDGE(pstcCMP_InitStruct->u8OutDetectEdges));
        DDL_ASSERT(IS_CMP_OUT_FILTER(pstcCMP_InitStruct->u8OutFilter));
        DDL_ASSERT(IS_CMP_OUT_POLARITY(pstcCMP_InitStruct->u8OutPolarity));
        DDL_ASSERT(IS_CMP_CVSL(pstcCMP_InitStruct->u8CmpVol));
        DDL_ASSERT(IS_CMP_RVSL(pstcCMP_InitStruct->u8RefVol));

        /* Stop CMP compare */
        WRITE_REG(CMPx->MDR, 0x00U);

        /* Set compare voltage and reference voltage */
        WRITE_REG(CMPx->VSR,
                  pstcCMP_InitStruct->u8CmpVol | pstcCMP_InitStruct->u8RefVol);
        /* Delay 300ns*/
        CMP_Delay300ns();

