levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_cmp.c
        /* Start CMP compare */
        WRITE_REG(CMPx->MDR, CMP_MDR_CENB);
        /* Delay 300ns*/
        CMP_Delay300ns();

        /* Set output filter and output detect edge and output polarity */
        WRITE_REG(CMPx->FIR,
                  pstcCMP_InitStruct->u8OutFilter | pstcCMP_InitStruct->u8OutDetectEdges);
        WRITE_REG(CMPx->OCR, pstcCMP_InitStruct->u8OutPolarity);
    }
    return enRet;
}

/**
 * @brief  CMP window mode initialize
 * @param  [in] pstcCMP_InitStruct Configuration structure for window mode initialize
 *              pstcCMP_InitStruct->u8WinVolLow
 *                                CMP reference low voltage for window mode,
 *                                @ref CMP_RVSL_Source
 *              pstcCMP_InitStruct->u8WinVolHigh
 *                                CMP reference high voltage for window mode,
 *                                @ref CMP_RVSL_Source
 *              pstcCMP_InitStruct->u8OutPolarity
 *                                Output polarity select, @ref CMP_Out_Polarity_Select
 *              pstcCMP_InitStruct->u8OutDetectEdges
 *                                Output detect edge, @ref CMP_Out_Detect_Edge
 *              pstcCMP_InitStruct->u8OutFilter
 *                                Output Filter, @ref CMP_Out_Filter
 *
 * @retval An en_result_t enumeration value:
 *              - Ok:             Successfully
 *              - ErrorInvalidParameter: CMPx or pointer of structure is invalid
 */
en_result_t CMP_WindowModeInit(const stc_cmp_init_t* pstcCMP_InitStruct)
{
    en_result_t enRet = Ok;
    /* Check configuration structure */
    if (NULL == pstcCMP_InitStruct)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_CMP_OUT_DETECT_EDGE(pstcCMP_InitStruct->u8OutDetectEdges));
        DDL_ASSERT(IS_CMP_OUT_FILTER(pstcCMP_InitStruct->u8OutFilter));
        DDL_ASSERT(IS_CMP_OUT_POLARITY(pstcCMP_InitStruct->u8OutPolarity));
        DDL_ASSERT(IS_CMP_RVSL(pstcCMP_InitStruct->u8WinVolLow));
        DDL_ASSERT(IS_CMP_RVSL(pstcCMP_InitStruct->u8WinVolHigh));

        /* Stop CMP compare */
        WRITE_REG(M4_CMP2->MDR, 0x00U);
        WRITE_REG(M4_CMP3->MDR, 0x00U);

        /* Set compare voltage and reference voltage */
        WRITE_REG(M4_CMP3->VSR,
                  CMP_CVSL_IVCMPx_2 | pstcCMP_InitStruct->u8WinVolLow);
        WRITE_REG(M4_CMP2->VSR,
                  CMP_CVSL_IVCMPx_2 | pstcCMP_InitStruct->u8WinVolHigh);

        /* Select window compare mode and start CMP compare function */
        WRITE_REG(M4_CMP2->MDR, CMP_MDR_CENB | CMP_MDR_CWDE);
        WRITE_REG(M4_CMP3->MDR, CMP_MDR_CENB);
        /* Delay 300ns*/
        CMP_Delay300ns();

        /* Set output filter and output detect edge and output polarity */
        WRITE_REG(M4_CMP2->FIR,
                  pstcCMP_InitStruct->u8OutFilter | pstcCMP_InitStruct->u8OutDetectEdges);
        WRITE_REG(M4_CMP2->OCR, pstcCMP_InitStruct->u8OutPolarity);
    }
    return enRet;
}

/**
 * @brief  CMP 8 bit DAC reference voltage configuration
 * @param  [in] u8DACData         DAC voltage data
 *              @arg              This parameter can be one data range 0x00~0xFF
 *                                DAC Voltage = VCCA x u8DACData / 255
 * @param  [in] u8AlignMode       DAC data register align mode
 *              @arg              This parameter @ref CMP_DAC_Align_mode
 * @retval An en_result_t enumeration value:
 *              - Ok:             Set successfully
 */
en_result_t CMP_8BitDACCfg(uint8_t u8DACData, uint16_t u16AlignMode)
{
    /* Check parameters */
    DDL_ASSERT(IS_CMP_DAC_ALIGN_MODE(u16AlignMode));

    if(CMP_DAC_ALIGN_RIGHT == u16AlignMode)
    {
        WRITE_REG16(M4_DAC->DADR1, u8DACData);
        CLEAR_REG16_BIT(M4_DAC->DACR1, CMP_DACR1_ALGN);
    }
    else
    {
        WRITE_REG16(M4_DAC->DADR1, u8DACData<<8U);
        SET_REG16_BIT(M4_DAC->DACR1, CMP_DACR1_ALGN);
    }
    return Ok;
}

/**
 * @brief  CMP 8 bit DAC reference voltage function command
 * @param  [in] enNewSta          The function new state.
 *              @arg              This parameter can be: Enable or Disable.
 * @retval An en_result_t enumeration value:
 *              - Ok:             Set successfully
 */
en_result_t CMP_8BitDACCmd(en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    (Enable == enNewSta) ?
      SET_REG16_BIT(M4_DAC->DACR1, CMP_DACR1_DAEN) :
       CLEAR_REG16_BIT(M4_DAC->DACR1, CMP_DACR1_DAEN);

    return Ok;
}

/**
 * @brief  De-initialize CMP unit
 * @param  [in] CMPx              Pointer to CMP instance register base,This
 *                                parameter can be one of the following values:
 *              @arg M4_CMP1:     CMP unit 1 instance register base
 *              @arg M4_CMP2:     CMP unit 2 instance register base
 *              @arg M4_CMP3:     CMP unit 3 instance register base
 * @retval An en_result_t enumeration value:
 *              - Ok:             Successfully
 *              - ErrorInvalidParameter: CMPx or pointer of structure is invalid
 */
en_result_t CMP_DeInit(M4_CMP_TypeDef *CMPx)
{
    en_result_t enRet = Ok;
    /* Check CMPx instance */
    if (!IS_CMP_INSTANCE(CMPx))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        CMPx->MDR = 0x00U;
        CMPx->FIR = 0x00U;
        CMPx->OCR = 0x00U;
        CMPx->VSR = 0x00U;
        CMPx->TWR1 = 0x00U;
        CMPx->TWR2 = 0x00U;
    }
    return enRet;
}

/**
 * @brief  Initialize structure stc_cmp_init_t variable with default value.
 * @param  [out] pstcCMP_InitStruct     Pointer to a stc_cmp_init_t structure variable
 *                                      which will be initialized.
 *   @arg  See the struct @ref stc_cmp_init_t.
 * @retval en_result_t
 */
en_result_t CMP_StructInit(stc_cmp_init_t* pstcCMP_InitStruct)
{
    en_result_t enRet = Ok;
    if (pstcCMP_InitStruct == NULL)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcCMP_InitStruct->u8CmpVol = CMP_CVSL_NONE;
        pstcCMP_InitStruct->u8RefVol = CMP_RVSL_NONE;
        pstcCMP_InitStruct->u8OutDetectEdges = (uint8_t)CMP_DETECT_EDGS_NONE;
        pstcCMP_InitStruct->u8OutFilter = CMP_OUT_FILTER_NONE;
        pstcCMP_InitStruct->u8OutPolarity = CMP_OUT_REVERSE_OFF;
        pstcCMP_InitStruct->u8WinVolLow = CMP_RVSL_NONE;
        pstcCMP_InitStruct->u8WinVolHigh = CMP_RVSL_NONE;
    }
    return enRet;
}

/**
 * @}
 */

/**
 * @brief  Software delay 300ns.
 * @param  None
 *
 * @retval None
 */
static void CMP_Delay300ns(void)
{
    for(uint32_t i=0UL; i<(SystemCoreClock/3333333UL + 1UL); i++)
    {
        __NOP();
    }
}

#endif /* DDL_CMP_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
